tap "jorgelbg/tap"

# Essentials
brew "gnupg"
brew "htop"
brew "neovim"
brew "starship"
brew "tldr"
brew "zsh"

# Unix tools
brew "bat"
brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep"
brew "tree"
brew "zoxide"

# Other apps
brew "gh"
brew "node"

# macOS specific
brew "gsed" if OS.mac?
brew "pinentry-mac" if OS.mac?
brew "pinentry-touchid" if OS.mac?
brew "wget" if OS.mac?
